interThermalPhaseFoam/tutorials/NusseltSmGF2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    Inlet
    {
        type            patch;
        nFaces          40;
        startFace       33730;
    }
    BotOutlet1
    {
        type            patch;
        nFaces          40;
        startFace       33770;
    }
    BotOutlet2
    {
        type            patch;
        nFaces          130;
        startFace       33810;
    }
    TopInlet
    {
        type            patch;
        nFaces          130;
        startFace       33940;
    }
    FreeStream
    {
        type            patch;
        nFaces          100;
        startFace       34070;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          34000;
        startFace       34170;
    }
    LeftSide
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       68170;
    }
)

// ************************************************************************* //
