interThermalPhaseFoam/tutorials/NusseltSmGF2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interThermalPhaseChangeFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30.05;

deltaT          1E-6;

writeControl    adjustableRunTime;
writeInterval   0.2;

//writeControl    timeStep;
//writeInterval   5;


purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           0.4;
maxAlphaCo      0.4;
maxFourier	0.5;

maxDeltaT       1E-2;
// ******************************************************************** //
//Global vars for funky/groovy
functions
(
	defineGlobalVars
	{
		type addGlobalVariable;

		globalScope globalVars;
		globalVariables
		{
			h_in
			{  
	    			valueType scalar; 
				value 0.0066329; 
			}

			T_w
			{
				valueType scalar;
				value 293;
			}

			T_sat
			{
				valueType scalar;
				value 298;
			}	

		}
	}

);

libs (
    "libOpenFOAM.so"
    "libgroovyBC.so"
    "libsimpleSwakFunctionObjects.so"
    "libswakFunctionObjects.so"
    "libtwoPhaseProperties.so"
    "libinterfaceProperties.so"
    //"libswakPythonIntegration.so"
    //"libinterfaceProperties.so"
    );
// ************************************************************************* //
